[
  {
    "review_info": {
      "id": "R3J84V14OM3RRS",
      "user_name": "",
      "email": "",
      "comment": "Dont buy this item… Received today and I dont understand if I have purchased an iPhone or an Android. It brings Android software and it looks very very cheap! Will add photos for you to all can see it. Just looking them its enough to understand its not an iPhone 7. It works very slow, the language is randomly changing between apps, it doesnt even have a good battery! The serial number in the phone its not the same that the the one on the box. Its not fair, I will find a way to return it because I dont live at USA. ABSOLUTELY NOT RECCOMENDED, DO NOT BUY THIS ITEM.",
      "rating": 0.2,
      "property": [
        {
          "key": "url",
          "value": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy=helpful&pageNumber=0"
        }
      ]
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "iPhone7",
        "base_score": 0.1,
        "property": []
      },
      {
        "id": "222222222222222",
        "name": "Battery",
        "base_score": 0.2,
        "property": []
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "R3J84V14OM3RRS",
        "range": "11111111111111"
      },
      {
        "type": "Feature",
        "domain": "11111111111111",
        "range": "222222222222222"
      }
    ]
  },
  {
    "review_info": {
      "id": "R1ZSB4V38XARA",
      "user_name": "",
      "email": "",
      "comment": "Be careful, I ordered this phone and it wasn't an unlocked phone. It is setup on the US Reseller Flex Policy. It looked like it was purchased at Best Buy, \"sim free\". I could not activate it with an international SIM Card. Luckily I found someone with a US Verizon SIM card to install durning the activation process. Once it was activated with the Verizon card I was able to install my international Sim Card and everything worked. If you are looking to purchase one of these phones internationally make sure you have a US sim card to go through the activation process, or research the US Reseller Flex Policy.",
      "rating": 1,
      "property": [
        {
          "key": "url",
          "value": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy=helpful&pageNumber=0"
        }
      ]
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "iPhone7",
        "base_score": 0.6,
        "property": []
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "R1ZSB4V38XARA",
        "range": "11111111111111"
      }
    ]
  },
  {
    "review_info": {
      "id": "RAC1OX3C88SFQ",
      "user_name": "",
      "email": "",
      "comment": "If anyone is interested to know how the 7 performs compared to the 6 and 6s Camera is a little better and you notice it for sure. It is a lot better in low lights conditions. SPEED, I was using a 6s and I notice a much snappier Safari and iMessage screens. Part of it may be IOS 10 but pages pop really fast. It is way way faster than the original 6. Black looks awesome!!! But is is so slick. There are no lines and it looks like a solid 1 piece product. I saw the Glossy Jet Black and it is a work of art but it show fine scratches. So most people will use a case which hides the back anyway so maybe color is not that important. Mainly if you want a white front or black. I love the new home button, took about 5 minutes to get use to and I don't miss the old home button at all. Any case with a large camera cutout like the CM4 wallet case works with the 7. But most likely all other will not. Some of mine I can cut out around the old camera hole and use it until new cases come out. But I promise you this phone is slippery when dry!! Overall I love it! Fastest device that I have ever used. I can out type the 6s sometimes on reviews but thiamine keep up no problem. 128g is perfect in size for most everyone. Hardcore photo and video people may want the 256g. No headphone jack, doesn't bother me at all. The adapter sounds fine with my expensive headphones. It's not really that large either. The lightning headphones sound really good to me. I tested the same song with the same headphone using a 6s and the 7 with the adapter and I cannot tell the difference. In some ways the 7 with the adpater sounded cleaner and had a little less aliasing hiss from the analog to digital conversion process. So beside have a little while cable sticking out I think the 7 audio is fine. IPhone 4,5, 5s, SE and 6 users will feel a huge speed increase. The 6s is not far off speed wise but it is noticeable to me. No matter how you split up the payment or go with a upgrade contract price, you'll pay full price for any of the phones. It is all just creative math by the vendors. I bought mine outright and got point on my credit card, enough to reduce my price by $25.00. I also heard the Black and Jet Blacks maybe high in demand. Hope this helps :)",
      "rating": 1.0,
      "property": [
        {
          "key": "url",
          "value": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy=helpful&pageNumber=0"
        }
      ]
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "iPhone7",
        "base_score": 0.8,
        "property": []
      },
      {
        "id": "222222222222222",
        "name": "iPhone6",
        "base_score": 0.5,
        "property": []
      },
      {
        "id": "3333333333333",
        "name": "iPhone6s",
        "base_score": 0.5,
        "property": []
      },
      {
        "id": "75656565555",
        "name": "Camera",
        "base_score": 0.9,
        "property": []
      },
      {
        "id": "756565655234",
        "name": "Camera",
        "base_score": 0.4,
        "property": []
      },
      {
        "id": "75656565254",
        "name": "Camera",
        "base_score": 0.4,
        "property": []
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "RAC1OX3C88SFQ",
        "range": "11111111111111"
      },
      {
        "type": "Feature",
        "domain": "11111111111111",
        "range": "75656565555"
      },
      {
        "type": "Feature",
        "domain": "222222222222222",
        "range": "756565655234"
      },
      {
        "type": "Feature",
        "domain": "3333333333333",
        "range": "75656565254"
      },
      {
        "type": "BetterThan",
        "domain": "75656565555",
        "range": "756565655234"
      },
      {
        "type": "BetterThan",
        "domain": "75656565555",
        "range": "75656565254"
      }
    ]
  },
  {
    "review_info": {
      "id": "R3J84V14OM3RRS",
      "user_name": "",
      "email": "",
      "comment": "Dont buy this item… Received today and I dont understand if I have purchased an iPhone or an Android. It brings Android software and it looks very very cheap! Will add photos for you to all can see it. Just looking them its enough to understand its not an iPhone 7. It works very slow, the language is randomly changing between apps, it doesnt even have a good battery! The serial number in the phone its not the same that the the one on the box. Its not fair, I will find a way to return it because I dont live at USA. ABSOLUTELY NOT RECCOMENDED, DO NOT BUY THIS ITEM.",
      "rating": 0.2,
      "property": [
        {
          "key": "url",
          "value": "review_info_value"
        }
      ]
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "iPhone7",
        "base_score": 0.8,
        "property": [
          {
            "key": "weight",
            "value": "20g"
          }
        ]
      },
      {
        "id": "222222222222222",
        "name": "Samsung Galaxy S5",
        "base_score": 0.7,
        "property": [
          {
            "key": "weight",
            "value": "10g"
          }
        ]
      },
      {
        "id": "3333333333333",
        "name": "Camera",
        "base_score": 0.6,
        "property": [
          {
            "key": "front camera",
            "value": "13MPX"
          }
        ]
      },
      {
        "id": "75656565555",
        "name": "Camera",
        "base_score": 0.9,
        "property": [
          {
            "key": "back camera",
            "value": "13MPX"
          }
        ]
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "112121212121",
        "range": "11111111111111"
      },
      {
        "type": "Feature",
        "domain": "11111111111111",
        "range": "3333333333333"
      },
      {
        "type": "Feature",
        "domain": "222222222222222",
        "range": "75656565555"
      },
      {
        "type": "BetterThan",
        "domain": "11111111111111",
        "range": "222222222222222"
      },
      {
        "type": "BetterThan",
        "domain": "3333333333333",
        "range": "75656565555"
      }
    ]
  },
  {
    "review_info": {
      "id": "R334XA4B15WSGL",
      "user_name": "",
      "email": "",
      "comment": "I have owned every iPhone since the 3G model. Every year for 7 years I have upgraded. In my household is a slew of Apple products from iPad’s, MacBook’s to iPhones. My household now has 3 new iPhone 7 models. But I am also a bigtime Android owner with several high end Android phones and tablets from various manufactures. The thing is, my family loves high end tech and appreciates quality regardless of brand, make or model. I follow the mobile tech world religiously and stay abreast of all new technologies and products from all companies, big and small. I watched the Keynote on September 7th live and listened to Apple pitch the iPhone 7. I pre-ordered the 7 at 3am EST on the 9th so I could have it in my hands on the 16th. But then I came to a realization about the 7 and 7 Plus that struck a chord with me. All the new tech on the 7 is not new at all, in fact has been on several phones in some cases since 2011. I also realized that the tech inside the 7 only matches mid-range android versions. If you take the Apple logo off the back and re-brand this under Android, it would not be a $770-$970 device but a $350-$550 device given the hardware and features it has. In fact, Apples net cost on the 256GB 7 Plus is only $226 yet retails for $970. This is disturbing to me, not just the 403% profit margin, but the whole effort into making an average iPhone for today’s standards. Apple use to be a leading-edge company with innovations that took the industry by storm. Today, in 2016, Apple no longer excites me. Sure the integration between software and hardware is not matched by any tech company today but the gap is rapidly bridging. At such a premium price, I think after this version, considering there is nothing innovative about it and retails for double what other companies offer, has me moving away from Apple in 2017. I don’t know about you, but the old saying goes the bigger you are the harder you fall. Bye bye Apple, time for a divorce. ___ Update 9/22/2016: In response to criticism about my review: ___ Apple certainly raised the bar on smartphones and has kept that bar up. My expectations are high for the iPhone and as such when they are not met, as with the iPhone 7/7 Plus, my letdown is all that much harder. The IPhone 7/7 Plus are great phones do doubt, but do I think they are $970 great? Certainly not. Apple (could have) done so much better with the iPhone 7 and didn't. That is my letdown. When it comes to raw processing power Apple wins in controlled and application tests. But in 2016/17 nearly all phones are fast enough, heck even the iPhone 5s of 4 years ago is fast enough, but today, shaving milliseconds off app switching times or load times goes beyond the human brains capacity to keep up. It's not about pure brawns, ecosystems, cultures, or social image, it's about value and making life's tasks easier. Apples multi-million dollar 12 step polishing process to get the Jet black phone to shine is not nearly as important as making it available at affordable prices and offering cutting edge features that make my whole reason for existing plausible. If I walked into my Honda dealer and saw the new 2017 Accord had a price tag of $110,000 I would walk out immediately, it's about value. Even if the Accord blew the doors off its competition I still walk because its value is lost. Truth of the matter is even India's $4 phone gets the job done, and that's a fact. Lets examine the iPhone 7/7 Plus components. CPU: The A10 Fusion chip in the Apple 7’s is manufactured by TSMC, (Samsung made the A9 chips in the 6s). It is a quad-core 16nm big.LITTLE soC running at 2.34GHz tops, 1.3GHz nominal with 3GB of LPDDR4 RAM, (2GB on the 4.7- inch version). Similar chips and even more powerful quad-core, hexi-core and even octa-core chips run in various far less expensive phones using 4GB to 6GB of LPDDR4 RAM running in dual channel mode. The one thing Apple does do extremely well is manage its RAM which is all software based. The Linux driven Android software has not got there yet. Yes, this is an advantage Apple currently holds over the competition but one that is vastly slipping away. LCD: The LCD panel is also on level with submarket phones. The LPIPS 1080 panel is rated at 401P, 1300:1 contrast, (1400:1 on the 4.7 inch), 625nits and P3 Cinematic color gamut at 125%. Let’s examine this. With the exception of the P3 color gamut, every $200 and above phone has this or better. I can list a slew of phones all under $300 that have LPIPS, (or even better OLED), 1080 FHD, 1500:1 to infinite contrast ratio, 500-700nits and sRGB color gamut at 100%. The Neo-LPIPS panel supplied on Huawei products is nearly as excellent as the S-AMOLEDS produced by Samsung and supplied on phones starting at $150. Apple has been in talks with Samsung about supplying s-AMOLED panels for the iPhone for 3 years, I believe the iPhone 8 will receive this panel next year. The cinematic P3 rating and higher brightness output (nit) was given to the iPhone 7’s to help make the photos pop on-screen better. CAMERA: The Bokeh effects of the dual camera system on the 7 Plus can easily be duplicated in Post with software. I won’t argue and say the camera implementation on the iPhone 7’s is not excellent, sure it is. But the Leica dual camera system on the P9 and Honor 8 are just as good and offered on devices that match or surpass other technical features and cost half as much. The camera system on the S7 is excellent too. LG has excellent implementations on the older G4, G5 and new V20. The LG G4 that can be had for $150, has a 2.1GHz hexi-core CPU, 3GB RAM, 5.5-ich QHD screen, 32GB on board memory, 128GB SD slot, and a 16MP camera that shoots in RAW and even by today’s standards is excellent shooter. SOFTWARE: With iOS 10 we can now delete stock Apple apps. This is Apples way of saying they understand their app versions suck and no one uses them or want them. We can replace them with much better 3rd party versions that also happen to have equally good Android versions. In the 30 days iOS 10 has been on the iPhone 7, (9/16 to 10/12), it has had two major updates, v10.0.1 and v10.0.2. Let’s not forget the epic failure of the lightening headphones, Gallery App and extensions crashing. This is a bug fix every two weeks. Also in the 30 days I have owned my iPhone 7 I have had to perform two hard resets for Apple Apps locking and seizing up, one was Safari the other iMessages. At one point I had to get Apple support on the phone. In 2016/2017 Android v7.01 (and 6.0.1) are just as stable and efficient and maybe even more so, but my point is there is no advantage one over the other, at this stage it is simply a matter of personal preferences. We can’t argue that iOS is superior to Android because surely is not. With almost all apps being cross-platform functional communications between iOS and Android is now transparent and we can fully immerse in both worlds without any effects. SAMSUNG: I have given the same review about Samsung products. Samsung is by no means the Messiah of Android. Their products are matched or outdone with less expensive variants as well. Samsung will have a very difficult time recovering from their $1B fiasco this year. When a company starts selling of its stock interest and shares on partner companies and liquidating core assets you know they are in trouble. STORAGE: The reason Apple does not offer external SD storage is twofold. One, the SD license is held by Microsoft and Apple would have to pay royalties to Microsoft in order to use it. Apple will never pay royalties to any company – royalties are paid to Apple not the other way around. Two, Apple would lose control over file sharing. APPLE TRIVIA - DID YOU KNOW: Did you know the iPhone has many Samsung components? Samsung has made the CPU/GPU for several generations of iPhones. This year with the 7 Samsung supplies the RAM chips and ROM chips. Samsung is rumored to supply its s-AMOLED screens next year for the iPhone 8. Did you know Google pays Apple $100 million/year to have Google set as the default search for Safari? Google also pays Apple a percentage for every click too. Did you know Google invests more money and R&D for its iOS apps over its own Android counterparts? Apps like Hangouts, Google Maps, Chrome, Google Now etc., get updates and new releases before its own native Android versions. Did you know that Amazon hosts the iCloud storage for Apple? Amazon is the largest cloud host in the world providing several companies with its AWS servers. Apple pays Amazon hundreds of millions of dollars every year for its cloud servers. Did you know Apple refused to pay Corning its royalties to use the Gorilla Glass name so calls its glass ‘Ionized strengthened’ even though it is Corning Gorilla glass version 4. Did you know the iPhone 6/6s also has water resistant features? Apple never published or made public this feature for liability reasons but the 6/6s has resins and glues inside to protect vital components from water damage. If you have ever dropped your 6/6s in water usually within a couple hours its up and running at 100%. ___ Thank you for reading ___",
      "rating": 0.40,
      "property": []
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "iPhone7",
        "base_score": 0.8,
        "property": []
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "R334XA4B15WSGL",
        "range": "11111111111111"
      }
    ]
  },
  {
    "review_info": {
      "id": "R1ZJO4SXJ2UXZ9",
      "user_name": "",
      "email": "",
      "comment": "I bought the Samsung Galaxy S7 Edge G935F in Black from this product page a week ago. A lot of people have asked questions about this particular international version so I'll answer some of those first. For starters, the one I got was the english edition for the Saudi Arabia market (see attached photos, the guides came in english and arabic). From what I can tell, the phone is the same as any other international edition but with different preinstalled apps. Mine came with a SA region specific app \"Shaid\" (seems to be a YouTube-esque app in arabic) that I uninstalled and WhatsApp. Other than that the only remaining bloatware was stock Samsung apps (no carrier apps, thank god), the only other thing I noticed that may be region specific is the S Planner app has a \"Hijri dates adjustment\" setting. Lastly this version ships with a non-us wall charger (aside from the regular stock accessories) shown in my review images. Mine also came with an adapter for use within the U.S., I have tried it and can confirm that it works with fast charging. This phone also uses a different chipset (manufactured by Samsung, called Exynos 8890) than the U.S. version. Reviews I read noted that the phone was actually optimized for this chipset w/ better performance and battery life than the U.S. Qualcomm counterpart (Google it). In the U.S. version the Qualcomm Snapdragon 820 chip is used to support Verizon and Sprint customers whereas this version only supports GSM carriers. To preface the review of the actual use of the phone, I have owned the following devices and used them each as a daily driver for at least a months time: Samsung Galaxy S4 GPE, Samsung Galaxy S5, iPhone 4, iPhone 4S, HTC One M8 GPE, iPhone 6, iPhone 6S, Nexus 5, Nexus 5X, Nexus 6P. The Galaxy S7 Edge has been the most delightful experience of the bunch. I won't go into great detail here but the camera is phenomenal and launches faster than any other phone I've owned w/ a double tap of the home button. The camera's auto focus is super fast and I feel like I'm able to get a capture a lot of moments that my previous phones were too slow to shoot. It's also nice to be able to change the quick launch apps on the lock screen, I have the dialer and snapchat as mine. Continuing a theme of high performance this phone is incredibly fast despite powering a QHD resolution screen. Apps are surprisingly quick to load and multitasking is a breeze (I even found some use in the Samsung's split screen feature). The fingerprint scanner is on par with apple devices (and nexus 6p/5x) although because of it's non-circular shape I find that I place my finger the wrong way more often. The battery is the best of any device I've used as a daily driver, I've been able to get through days of heavy usage like today (unplugged from charger at 5:45am, now at 25% at 9:03pm). The screen is BEAUTIFUL. Not only is it easy to read even in direct sunlight (something I have seen other devices struggle with) but the colors are vibrant and the screen is huge without making the phone too big or bulky. Perfect for watching YouTube videos and browsing instagram. Lastly a few notes if you buy this phone: - If you're not a fan of the stock Samsung launcher you can get the Google Now launcher from the Play Store, it's the same one used on Nexus devices and feels smoother than Samsung's launcher. - This time around Samsung decided to give you bigger icons which drove me nuts, search for \"Get more on your Galaxy S7, S6 or Note 5 screen with hidden DPI scaling settings\" from Android authority to get a 5th column on the home screen and smaller UI elements. - \"Edge functionality\" is just okay. The feature feels a bit less than polished because of the weak offerings in the Samsung app store - I have it turned off. Edit 4/8/2016: sorry about the quality of the photos of the actual phone - they were shot with the wide angle lens of my GoPro whereas the other images were shot with the S7 Edge. Edit 4/10/2016: added some higher quality images from my new camera. Update 5/9/2016: I've been using the phone as a daily driver for over a month now. I'm still impressed by the overall gfx smoothness, how fast apps load, and camera performance. Update 7/25/2016: still in love with this phone. I'm honestly not sure what would compel me to purchase a new phone at this point.. I also rooted the phone and changed the emojis to the iOS 9 set with the Emoji Switcher app from the play store. No more guessing when messaging my iOS friends =) A lot of commenters have asked which seller I purchased mine from: Wireless Everything.",
      "rating": 0.2,
      "property": [
        {
          "key": "url",
          "value": "http://www.amazon.com/product-reviews/B01CJU9BBM/?sortBy=helpful&pageNumber=0"
        }
      ]
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "Samsung Galaxy S7 Edge",
        "base_score": 0.3,
        "property": [
        ]
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "R1ZJO4SXJ2UXZ9",
        "range": "11111111111111"
      }
    ]
  },
  {
    "review_info": {
      "id": "RMKOOXTFS1RIR",
      "user_name": "",
      "email": "",
      "comment": "I bought the phone in April 2016 and worked perfect until October of that year when it started to restart itself and every time, and VERY HOT. There are days when I just can not use it and many others work fine. I contacted Amazon and they told me that it was out of the 30 day warranty but that I¨ll should go to a Samsun Center for the 1 year warranty. I did it and as I live in Ecuador, South America, I took it to the authorized center and they told me that the problem should be that it has to be update, it but they could not do it because the phone is from Egypt !! And that only in the place of origin it can be done!! So when they buy a phone notice of which zone it is. Sold by: Wireless Place. Now in March 2017 the cell phone stopped working. For having been bought on Amazon it had no Samsung warranty and as the damage occurred after the first 3 months, Amazon also did not take responsibility. I lost the $ 750 that it cost me before a year of use. I will never bought a mobile phone in Amazon again.",
      "rating": 0.2,
      "property": [
        {
          "key": "url",
          "value": "http://www.amazon.com/product-reviews/B01CJU9BBM/?sortBy=helpful&pageNumber=0"
        }
      ]
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "Samsung Galaxy S7 Edge",
        "base_score": 0.4,
        "property": [
        ]
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "RMKOOXTFS1RIR",
        "range": "11111111111111"
      }
    ]
  },
  {
    "review_info": {
      "id": "R2RDTMETNX3DVV",
      "user_name": "",
      "email": "",
      "comment": "This phone is a mess. I used to love the first months but now I don't have any signal( I tried 3 conpanies already) and is heaing up and freezing and starting the phone. Also my fingerprins don't work. I can't believe amazon is selling fake phones or damaged phones",
      "rating": 0.2,
      "property": [
        {
          "key": "url",
          "value": "http://www.amazon.com/product-reviews/B01CJU9BBM/?sortBy=helpful&pageNumber=0"
        }
      ]
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "Samsung Galaxy S7 Edge",
        "base_score": 0.5,
        "property": [
        ]
      },
      {
        "id": "22222222222",
        "name": "Finger Print",
        "base_score": 0.2,
        "property": [
        ]
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "RMKOOXTFS1RIR",
        "range": "11111111111111"
      },
      {
        "type": "Feature",
        "domain": "11111111111111",
        "range": "22222222222"
      }
    ]
  },
  {
    "review_info": {
      "id": "R2ZIIZCB8TU11A",
      "user_name": "",
      "email": "",
      "comment": "I purchased the phone some 8 months ago when renewing my mobile contract. This was the first Samsung that, to me, felt as well-built as an iPhone but what I didn't expect was 1) a design issue with renders a vertical pink line 2) that Samsung, through the network operator, would be unwilling honor warranty on its products even though the phone has never been dropped, mishandled or submerged - claiming because I'd used a \"generic charger\" (cigarette lighter adapter for USB) that had caused damage to the motherboard and was allegedly resulting in spontaneous reboots - which during 8 months of use never actually happened and still doesn't happen!. Anyway, the point is that they'll cling on to any excuse to not honor warranty even though the issue is a design issue widely documented online. It appears that a ribbon on the side of the front camera that connects the screen is held in place with glue. The issue is that with the heat that the phone generates, the glue melts and the ribbon loses contact (pressing next to the camera actually temporarily fixes the problem… until the problem comes back). The fix is to apparently to un-glue the screen adjust the contacts and glue it back (likely resulting in a broken screen) or to simply replace it at considerable cost - although there's nothing to say the pink line won't reappear on the new screen down the line when the glue starts to melt again… Personally I refuse to back a company that doesn't back their products, so that's no more Samsung for me. Surely the whole exploding Note issue should've been enough for Samsung to consider applying decent warranty policies to retain the customers they already have, shouldn't it?",
      "rating": 0.2,
      "property": [
        {
          "key": "url",
          "value": "http://www.amazon.com/product-reviews/B01CJU9BBM/?sortBy=helpful&pageNumber=0"
        }
      ]
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "Samsung Galaxy S7 Edge",
        "base_score": 0.4,
        "property": [
        ]
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "R2ZIIZCB8TU11A",
        "range": "11111111111111"
      }
    ]
  },
  {
    "review_info": {
      "id": "R31IMNIFL7EQJJ",
      "user_name": "",
      "email": "",
      "comment": "I have had most of the Galaxy and definitely this has been the most thorough in every respect. Impeccable design of glass with its edges in aluminum; Amazing picture quality on the screen. The most impressive thing about this phone is the battery life, really very durable using the phone constantly. Good audio quality but would be perfect if they incorporate an additional external speaker. Excellent edge functions. Software fluency, no lag problems and multi window is good.",
      "rating": 1,
      "property": [
        {
          "key": "url",
          "value": "http://www.amazon.com/product-reviews/B01CJU9BBM/?sortBy=helpful&pageNumber=0"
        }
      ]
    },
    "entities": [
      {
        "id": "11111111111111",
        "name": "Samsung Galaxy S7 Edge",
        "base_score": 0.9,
        "property": [
        ]
      },
      {
        "id": "222222222222",
        "name": "Battery",
        "base_score": 0.8,
        "property": [
        ]
      },
      {
        "id": "3333333333333",
        "name": "Audio",
        "base_score": 0.7,
        "property": [
        ]
      }
    ],
    "relationships": [
      {
        "type": "MainEntity",
        "domain": "R31IMNIFL7EQJJ",
        "range": "11111111111111"
      },
      {
        "type": "Feature",
        "domain": "11111111111111",
        "range": "222222222222"
      },
      {
        "type": "Feature",
        "domain": "11111111111111",
        "range": "3333333333333"
      }
    ]
  }
]