[
  {
    "review_id": "RKTKN3VZM6522",
    "title": "From a 6S to an X - A wonderful, luxury, phone.",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 7, 2017 12:00:00 AM",
    "reviewContent": "I received my X on launch day and I absolutely love this phone. If you would like a list of just my thoughts on the phone, scroll down pass the introduction. The transition: NO home button! The staple of the iPhone is gone; well, moved to a little notch at the top. I was expecting this transition to a home-button-less iPhone to be difficult, but all of the gestures feel so natural. I find myself annoyed trying to utilized an older iPhone as the interface now feels clunky. Switching through apps, opening the phone, accessing everything, it\u0027s all so easy. Now, this isn\u0027t to say there isn\u0027t a transition and while everything feels natural, there is a period of time where you have to get used to the new interface and some aspects that initially seemed difficult become second nature. For example, reachability was a favorite feature of mine and while it was initially hard to activate, I have now learned how to activate it without an issue (reachability brings the iPhone screen down halfway to reach top parts of the screen without moving your hand). Face ID: I was skeptical to say the least, but Face ID works (almost) perfect. It does however learn from its missteps and if it fails to identify you, it will add that data to its cache. I personally scanned my face normally the first time and on the second scan did it at roughly a 45 degree angle so I could lean over my phone to view notifications. As I\u0027ve adjusted to Face ID, it has gotten faster and faster at scanning my face and it\u0027s not something you need to wait on to open your phone. By the time you swipe up on your phone, it\u0027s unlocked and ready to go (I seriously forget I have a password). I also really enjoy the ability to utilize Face ID for my password for other logins and the ability to open up an app directly from the lock screen without having to then enter my fingerprint/passcode. It\u0027s important to note here that your privacy is well, yours. No one has access to the data Face ID gather\u0027s and it is truly yours. Apple has a good track record on keeping your data private as they are not in the data business (hello Google \u0026 Facebook). The price: There seems to be this running idea that a $1,000 phone is a crazy purchase, but I would have to disagree. Why? My logic is as followed: Phone\u0027s are one of the most used devices (easily mine) so for starters, I would like a nice one. If I didn\u0027t buy the device in full, I would have been paying roughly $2/ a day on a contract with Verizon. The base model is a 64GB iPhone loaded with the best Apple has to offer. A 128GB 6S at launch was $850. Yes, there\u0027s a price difference, but my point is that it\u0027s not as gigantic as it may seem. I personally would advocate a 64GB version and utilizing cloud storage if you need more space, but do note, this is Apple\u0027s flagship and there are cheaper iPhone\u0027s out there. What I love: - The screen looks amazing. The colors are vibrant, the blacks are deep with black wallpapers flowing aimlessly into the phone (to the point you cannot see the notch in the screen if the wallpaper is black). - The Notch! Yes, the notch. Some people seem to hate it, I think it\u0027s iconic and makes the iPhone X stand alone in oled sphere. It fades into the user experience and I have not had any issues with it. - The screen size. I have always wanted a plus, but I always felt like it was too big for my hands. That I would drop the phone and there it goes. The X remedies this for me and I get to use a larger screen in nearly the same form factor as my 6S. The screen truly looks amazing and if you haven\u0027t seen one, check one out at a local store. - I\u0027m not sure how much of this is just because my 6S was a few years old, but the taptic engine in the X is amazing. As in, when the phone vibrates, I can easily identify what it is through the vibration and the vibration itself feels smooth. - Force touch is also fantastic and the haptic feedback on everything from a like on twitter to moving apps around is wonderful. Makes the screen feel more three-dimensional in a way. - The camera takes wonderful pictures. I have taken a few pictures in portrait mode and some pictures genuinely look like they were taken with a DSLR camera. - The speakers are louder than I expected and sound very clear. Great for impromptu music listening. - The phone is a little heavy, but it is definitely comfortable to hold. It feels like a luxury device and has a certain weight to it. What I don\u0027t: Honestly, I do not have a genuine complaint at this point. The only complaint that comes to mind revolves around the lack of optimization I have faced in some apps, but that is a developer problem and even then, developers have optimized a majority of their apps and my issues have been few and far between.",
    "classLabel": 5
  },
  {
    "review_id": "R1ENG94TAPGZ3N",
    "title": "Iphone X: A complete re-design and leap forward for Apple.",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 6, 2017 12:00:00 AM",
    "reviewContent": "Everyone reading this is probably familiar with the Apple phone line up so I am going to focus on the differences between the iPhone X and iPhone 7 plus specifically. First off, the set-up process has been significantly streamlined. When setting up your new iPhone X setup will ask you if your old iPhone is nearby, select yes, and you can wireless transfer all your apps, settings, backgrounds, passwords, etc. to your new phone in a few clicks. I really appreciated this streamlined process and it was incredibly quick and easy to transfer all my settings to my new iPhone X. The other main features that have been upgraded are as follows: New screen (5.8” OLED is the most vibrant and clear screen ever produced by Apple) - Apple has removed the touch ID sensor and bezel around the old iPhone screen which means the iPhone X has a noticeably smaller footprint while maintaining a larger screen size than the iPhone 7/8 Plus. (See comparison images attached of the iPhone X versus iPhone 7 Plus). - OLED Screen offers deeper blacks and brighter whites resulting in greater color reproduction. - Similar to the iPhone 8 and 8 Plus the iPhone X uses true tone technology to mimic the lighting conditions around it and adjust the white balance accordingly. - The notch cut out of the top of the screen is where Apple has included the face recognition sensors, front camera, and a host of other sensors. I thought this would be annoying but Apple has cleverly used the screen real estate on both sides to include the time, date, battery indicators, etc. Farewell Touch-ID, Hello Face-ID - Face-ID is Apples new facial recognition technology which has replaced the finger printer reader and home button in order to free up additional screen real-estate. This is new and only available on the iPhone X. - Apples facial recognition is light years ahead of Samsung or any other carrier. I have tested this flawlessly with glasses, a hat, and even in the dark. It is as simple as looking at your phone and swiping up from the bottom. - I was worried this feature would be inconsistent or frustrating but it has worked really well. The only time it is a bit more inconvenient is if the phone is sitting on your desk or a flat surface you kind of have to lean over a bit or angle the phone towards you to unlock it. - This super powerful new camera also enables the animoji features which maps your facial expressions to create a talking emoji. This is a fun feature but more a novelty than anything. - This same true-depth camera makes the iPhone X the ultimate phone for taking selfies. The new portrait mode allows the user blur the background, or even cut yourself out entirely and place yourself on a black background. Additional noteworthy features and changes: - The rear camera boasts a dual 12MP sensor array with improved aperture and wide angle lens with image stabilization. The increased aperture from 2.8 to 2.4 allows for better images in low light conditions. - Video capabilities have also approved as well to include 60p 4k video recording delivering clear, fluid images. - Increased audio quality and volume - Increased RAM size to 3GB and new Bionic Chip makes the iPhone X one of the most powerful smartphones are the market. - Updated design features glass back and sides which make the phone beautiful looking. A very welcome change in the normal design. - Battery life: The iPhone X boasts the largest battery in Apple history with a 2716 mAh battery which is a bit larger than the new iPhone 8 Plus. A full charge from 0-100% takes about 2 hours and 10 minutes in my testing. - In addition, wireless charging has finally been added to the new iPhone X, and 8 series phones. I have not tested this out but am excited to give it a try (Wireless charging pad is not included with the phone). Bottom line, the iPhone X is another smash hit from Apple. Every feature people were concerned about turned out to work flawlessly as usual. I have only had the iPhone for about 24 hours so it is early to leave a long-term focused review but so far the new iPhone X has lived up to the hype. The iPhone X may not revolutionize the smart phone industry but it is a welcome upgrade to the iPhone which designs were getting a bit dated. I am excited about Apples new strategy to release a flagship model and allow the new features to trickle down to next generation’s phones. If you have the money to spare you won’t likely be disappointed. My only complaint is the phone only comes in 64GB or 256GB basically forcing users to pay an extra $150 to get decent storage. Further, the beautiful glass back on the screen feels fantastic and has a great weight to it. However, a replacement screen will cost you $275+ and the back glass replacement is rumored to cost around $400. Essentially a single drop could result in a $700 repair bill. Unfortunately this means most phones will be shielded in a case and will not be enjoyed.",
    "classLabel": 5
  },
  {
    "review_id": "R3OEIAOBXYKAPO",
    "title": "Worth the upgrade",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 6, 2017 12:00:00 AM",
    "reviewContent": "My brothers and I began buying and upgraded to the latest iPhone since the very first version and the iPhone X is one the the biggest changes that I can remember. Much like going from the iPhone 3GS to the 4 was or the iPhone 5 to the 6. The X model looses the Home Button and doesn’t have a the headphone jack like the 7’s. No big deal on the headphone jack. Sometimes I do prefer plugging a set in and not having to worry about Bluetooth. The lack of a Home button does take some time getting use too. It is really different with the swipe gestures but after a day or so you get use to it. Basically learning a new way to switch and X out of apps. I like it now after using it. The phone is fast, feels crisper than the 7. Safari is snappier and pretty much all the apps are. The phones size is somewhat like the 7, feels thinner but is a tad larger. If you can afford it, you will be happy. I played with the iPhone 8 and it feels quicker too. The Face ID works really well. Being brothers that look a lot alike we try to trick it but it doesn’t work. This is the first of what will be new technologies for Apple like the Face ID, this was probably rushed and the next version will be more secure and work better. But it seems to work fine right now and does take the place of the finger ID pretty well. Camera takes awesome pictures. The 256g model can hold a lot of data which is nice and since your spending a grand you might as well spend the extra money and get the extra memory Pleased so far and looks like a solid reliable phone. In all fairness though, I could get by just fine with the iPhone 7 that I have been using. The main thing I like is the larger screen which is gorgeous and the faster processor. I love the phone but honestly I could have waited a year for the next model. If you can afford it now you’ll enjoy it. The size is perfect for me and the screen is awesome. Get a good case to protect it with which also hide the gorgeous design. I never really saw the iPhone 7 in black that I had because I always had it in a heavy duty case to protect it. It’s a shame to hide such great looking devices but you kinda have to so they don’t get dinged up.",
    "classLabel": 5
  },
  {
    "review_id": "R3EMLWR7PLOYKI",
    "title": "Own the future of smartphones NOW",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 23, 2017 12:00:00 AM",
    "reviewContent": "Upgraded from an iPhone 8 Plus. Must say it took some time getting used to the X but I love it. FaceID has worked well over 80 % of the time for me. The OLED screen is beautiful. The notch is not noticeable after you get used to it and distinguishes the iPhone.",
    "classLabel": 5
  },
  {
    "review_id": "R1RXELYHWD3RNF",
    "title": "Is the X worth a small fortune?",
    "rating": 4,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 24, 2017 12:00:00 AM",
    "reviewContent": " Is the iPhone X really worth the premium price of entry? whether you spend $999 (Apple retail) on the 64GB version or $1,149 (Apple retail) for the 256GB version, i examine in the vid exactly what your money buys",
    "classLabel": 4
  },
  {
    "review_id": "R2801Y36AD5D3A",
    "title": "Some Apple x screens are shipping with defects.",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 26, 2017 12:00:00 AM",
    "reviewContent": "Have had phone 10 days and OLED screen is experiencing green line on edge of screen. CNET and Apple’s own user community forum are indicating this is hardware manufacturing defect. Screen has green hue overall, so I now have to schedule appointment at Apple Genius to return for replacement.",
    "classLabel": 1
  },
  {
    "review_id": "R1OTQBYGGJJPBA",
    "title": "Five Stars",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 16, 2017 12:00:00 AM",
    "reviewContent": "It came perfectly not a scratch the display was amazing",
    "classLabel": 5
  },
  {
    "review_id": "R1CEX1UKYUIESG",
    "title": "Hello I Have A Youtube/Instagram That’s All About Tech And I Would Love To Promote This Mind Blowing Phone.",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 17, 2017 12:00:00 AM",
    "reviewContent": "Apple Is My Favorite Electronic Provider",
    "classLabel": 5
  },
  {
    "review_id": "R13JHGPI3Y8MCY",
    "title": "iPhone X Defect",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 11, 2017 12:00:00 AM",
    "reviewContent": "My iPhone X expierence so far. Preordered on Oct. 27th and managed to get a Gray/Black 256GB Iphone X. Finally arrives on the 6th and I don’t get a chance to open it up and attempt to hook up my new phone until the 11th. So here I go beaming with excitement to check out my new device that just cost me the equivalent of a house payment. Open it up and everything looks good at first and then I use my iPhone 6S light to look at the screen for any dust as I’ve already gotten a screen protector in hand to put on my new device before I even get started. Then I see it. A very very small scratch or crack under the screen coming from the notch area at the top of the phone coming down maybe 1/2 a cm long. So I schedule an appointment to talk to an Apple rep. for 8:45am and he finally calls me at 8:48am. I explain to him what I observed on my phone and he doesn’t seem to thrilled to help me out today. Maybe because it’s a Saturday and he’s at work. During our conversation he makes a statement that I didn’t really care for. Such as... Maybe the delivery man dropped your package and maybe that’s what happened. Obviously this is a manufacturing defect since it’s under the screen. So I get two options. Option A) Send my phone in to be repaired and who knows how long that will take and why would I want a brand new item I just paid a lot of money for to be repaired due to a defect. Option B) Go to the Apple Store and have them look at it and I can try and request a new phone. Oh and the next available time I can get an appointment is 4 days away and I’ll have to take off work early to resolve an Apple manufacturing defect. So I guess we will see how my Apple Store experience goes. I’ve had an Apple phone going back to the 3GS days and I’ve dealt with Apple Customer Service in the past with no issues but so far I’d have to say I’m extremely disappointed in the quality control of the IPhone X and the customer service expierence with Apple. Hopefully all is redeemed on the 14th. To be continued...",
    "classLabel": 1
  },
  {
    "review_id": "RLC4RLW1JKQIW",
    "title": "Quality Problems with the iPhone X",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B075QN8NDH/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 12, 2017 12:00:00 AM",
    "reviewContent": "just bought an iPhone X for my son in college to replace his iPhone 7+. He called us tonight but the speakerphone quality was horrible. He could hear us fine but it sounded like he was underwater (it was too difficult to understand him so we hung up early). I am quite sure it was not a signal issue as we speak with him every Sunday from his apartment with good signal (AT\u0026T). My advice is to take your time ordering in case it is a hardware defect that cannot be solved by a software update. Hopefully it is the latter given what I paid for it.",
    "classLabel": 1
  }
]