[
  {
    "review_id": "R2EEY3SBDMTFOF",
    "title": "Stolen phone sold as unlocked",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Jul 30, 2015 12:00:00 AM",
    "reviewContent": "Item was listed as unlocked and when I received it, the phone wouldn\u0027t work with my carrier. I called ATT and the phone is listed on the national stolen list. This phone cannot be used period.",
    "classLabel": 1
  },
  {
    "review_id": "R27JS6DIVQZIK7",
    "title": "Scammer",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Aug 15, 2016 12:00:00 AM",
    "reviewContent": "I didn\u0027t get a phone. I opened the package and found clay!!!",
    "classLabel": 1
  },
  {
    "review_id": "R2P3FWA5FHVV8",
    "title": "Missing phone!",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Dec 18, 2016 12:00:00 AM",
    "reviewContent": "Received only the charger!! No phone in box! Paid alot of money and now I\u0027m screwed for my daughters big Christmas surprise! Beyond pissed!",
    "classLabel": 1
  },
  {
    "review_id": "R12IJX9V0WX28W",
    "title": "Has a good SPEC case on it",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Dec 17, 2016 12:00:00 AM",
    "reviewContent": "When I first got the phone I was extatic! Couldn\u0027t believe I got an Iphone 6 plus for the 389 price. Phone worked perfectly for a couple days. I did inspet the phone and noticed a small indentation on the back mid way bottom but it was so slight. Called my daughter on the phone. Put the phone down and picked up to call again and the screen was frozen. I am 60 years old and am very careful with my electronics. Has a good SPEC case on it. DID NOT EVER DROP IT. I googled how to fix and did everything that was suggested. Nothing worked. Drove to the Apple store and was very impressed I only has to wait 5 min to be waited on. The Apple guy showed me how to tell if phone had been dropped or \"bent\" as he called it. He put his finger on the back and thumb on the front and squeezed and the phone started flickering. Only way to fix was replace phone. It cost me $150 dollars to get a refurbished Iphone 6 plus that has a 90 day warranty. Yes I could have returned the phone to person I got it from oh Amazon but where can I get an Iphone plus unlocked to use on my straighttalk carrier for 550? I did ask the person I bought from to reimburse as the Apple guy said the seller knew the phone was deffective and shouldnt have sold it. I have not heard from the seller as of yet. I realize its buyer beware and I have learned my lesson. Hope this helps another buyer.",
    "classLabel": 1
  },
  {
    "review_id": "RGVIMW5VXN2W2",
    "title": "I received the phone with multiple scratches and touch screen ...",
    "rating": 3,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Jun 1, 2017 12:00:00 AM",
    "reviewContent": "I received the phone with multiple scratches and touch screen didn\u0027t work; however, I got my money back without problems.",
    "classLabel": 3
  },
  {
    "review_id": "R19LV3RN3WVQC4",
    "title": "Very disappointed that my phone came in this condition",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 22, 2017 12:00:00 AM",
    "reviewContent": "Fast shipping, but the phone however glitched out and had a grey flickering bar at the top of the screen \u0026 also had an unresponsive touch screen when I turned it on. From my research \u0026 understanding it has \"touch disease\". Very disappointed that my phone came in this condition. However, very satisfied with how fast it shipped.",
    "classLabel": 1
  },
  {
    "review_id": "RERM9JUY26XX0",
    "title": "I phone 6pluse is really good one thanks amazon",
    "rating": 4,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Dec 5, 2016 12:00:00 AM",
    "reviewContent": "I brought iPhone 6 pulse from amazon it\u0027s really good for me",
    "classLabel": 4
  },
  {
    "review_id": "R1VBIO3TQ09K5J",
    "title": "Five Stars",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 24, 2017 12:00:00 AM",
    "reviewContent": "Came in packaging! In brand new condition. Worked perfectly. No complaints",
    "classLabel": 5
  },
  {
    "review_id": "R3BYLUB47SI2VE",
    "title": "Great phone minimal damage just one problem when you go ...",
    "rating": 4,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Mar 18, 2017 12:00:00 AM",
    "reviewContent": "Great phone minimal damage just one problem when you go to take a picture the shutter sound that you get is very loud and is not able to be turned off I took it to the Apple Store and they said it was something to do with the internal software and they could not shut it off but other than that it is great",
    "classLabel": 4
  },
  {
    "review_id": "RM9J27NYR365Z",
    "title": "Give Apple a chance, don\u0027t be such a fanboy!",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B00NQGOMZE/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Jul 22, 2015 12:00:00 AM",
    "reviewContent": "So I\u0027ve using android for almost 3 years and wanted to try something new. I\u0027ve had the note 2, 3 \u0026 even an s5. Which are all great phones. But android got so boring to me. I\u0027ve loved the look of iOS 8 ever since Apple changed the look of their os. So I figured why not try the iPhone. Not only does the phone feel premium but the os does too. Phones aren\u0027t getting any cheaper unless they\u0027re old ones. So don\u0027t think you have to be rich to get an iPhone! I\u0027m by no means rich. The battery life on this phone is a champ. With lite to heavy use, I can\u0027t can\u0027t kill my battery in a single day. So big phone but if u like your battery to last u most of the day consider the 6plus. ((DO NOT GET A 16GB IPHONE!!!!)) your space will be gone Ina snap. I don\u0027t even know why apple offers a 16GB option.. Only thing I\u0027ll miss is having back \u0026 menu buttons android phones had. Other then that, this phones smooth, and it just works! Dont listen to the fanboys/girls. My iPhone has a lag here \u0026 there but it\u0027s still fast %98 of the time! But if it lags just go into ur settings and turn off stuff you don\u0027t use or need. thanks for reading consumers !!!",
    "classLabel": 5
  }
]