[
  {
    "review_id": "R1ZSB4V38XARA",
    "title": "Not all are completely unlocked.",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Oct 9, 2016 12:00:00 AM",
    "reviewContent": "Be careful, I ordered this phone and it wasn\u0027t an unlocked phone. It is setup on the US Reseller Flex Policy. It looked like it was purchased at Best Buy, \"sim free\". I could not activate it with an international SIM Card. Luckily I found someone with a US Verizon SIM card to install durning the activation process. Once it was activated with the Verizon card I was able to install my international Sim Card and everything worked. If you are looking to purchase one of these phones internationally make sure you have a US sim card to go through the activation process, or research the US Reseller Flex Policy.",
    "classLabel": 5
  },
  {
    "review_id": "R3J84V14OM3RRS",
    "title": "DO NOT BUY THIS!",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Jan 25, 2017 12:00:00 AM",
    "reviewContent": "Dont buy this item... Received today and I dont understand if I have purchased an iPhone or an Android. It brings Android software and it looks very very cheap! Will add photos for you to all can see it. Just looking them its enough to understand its not an iPhone 7. It works very slow, the language is randomly changing between apps, it doesnt even have a good battery! The serial number in the phone its not the same that the the one on the box. Its not fair, I will find a way to return it because I dont live at USA. ABSOLUTELY NOT RECCOMENDED, DO NOT BUY THIS ITEM.",
    "classLabel": 1
  },
  {
    "review_id": "RVLSQBME75HBD",
    "title": "Buyer Beware",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Mar 3, 2017 12:00:00 AM",
    "reviewContent": "BUYER BEWARE. I purchased this phone a few days ago, today it was delivered, the problem is that I opened the box and there was NO PHONE INSIDE. Only the charger and the headphones.",
    "classLabel": 1
  },
  {
    "review_id": "RAC1OX3C88SFQ",
    "title": "Awesome Phone - worth upgrading!",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Sep 18, 2016 12:00:00 AM",
    "reviewContent": "If anyone is interested to know how the 7 performs compared to the 6 and 6s Camera is a little better and you notice it for sure. It is a lot better in low lights conditions. SPEED, I was using a 6s and I notice a much snappier Safari and iMessage screens. Part of it may be IOS 10 but pages pop really fast. It is way way faster than the original 6. Black looks awesome!!! But is is so slick. There are no lines and it looks like a solid 1 piece product. I saw the Glossy Jet Black and it is a work of art but it show fine scratches. So most people will use a case which hides the back anyway so maybe color is not that important. Mainly if you want a white front or black. I love the new home button, took about 5 minutes to get use to and I don\u0027t miss the old home button at all. Any case with a large camera cutout like the CM4 wallet case works with the 7. But most likely all other will not. Some of mine I can cut out around the old camera hole and use it until new cases come out. But I promise you this phone is slippery when dry!! Overall I love it! Fastest device that I have ever used. I can out type the 6s sometimes on reviews but thiamine keep up no problem. 128g is perfect in size for most everyone. Hardcore photo and video people may want the 256g. No headphone jack, doesn\u0027t bother me at all. The adapter sounds fine with my expensive headphones. It\u0027s not really that large either. The lightning headphones sound really good to me. I tested the same song with the same headphone using a 6s and the 7 with the adapter and I cannot tell the difference. In some ways the 7 with the adpater sounded cleaner and had a little less aliasing hiss from the analog to digital conversion process. So beside have a little while cable sticking out I think the 7 audio is fine. IPhone 4,5, 5s, SE and 6 users will feel a huge speed increase. The 6s is not far off speed wise but it is noticeable to me. No matter how you split up the payment or go with a upgrade contract price, you\u0027ll pay full price for any of the phones. It is all just creative math by the vendors. I bought mine outright and got point on my credit card, enough to reduce my price by $25.00. I also heard the Black and Jet Blacks maybe high in demand. Hope this helps :)",
    "classLabel": 5
  },
  {
    "review_id": "R2DPH39YX75T4J",
    "title": "Five Stars",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Jan 7, 2017 12:00:00 AM",
    "reviewContent": "Good phone. Happy with it.",
    "classLabel": 5
  },
  {
    "review_id": "R23RYWTH226YYO",
    "title": "Five Stars",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Dec 16, 2016 12:00:00 AM",
    "reviewContent": "Works as described (in USA)....",
    "classLabel": 5
  },
  {
    "review_id": "RJJZQJF89MV85",
    "title": "Two Stars",
    "rating": 2,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 7, 2017 12:00:00 AM",
    "reviewContent": "Just had to replace. I expected it to last longer. Was not cheap!",
    "classLabel": 2
  },
  {
    "review_id": "R1QUGXIDAXXHOH",
    "title": "Four Stars",
    "rating": 4,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 14, 2017 12:00:00 AM",
    "reviewContent": "I liked it, the cellphone works excellent. The only problem was the box, it seemed like a fake one.",
    "classLabel": 4
  },
  {
    "review_id": "R1U44QK22NV8YM",
    "title": "Everythings else is fine.",
    "rating": 4,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Nov 22, 2017 12:00:00 AM",
    "reviewContent": "There are scratches on the screen obviously!!! Everythings else is fine.",
    "classLabel": 4
  },
  {
    "review_id": "RQMRV1WCFEXC9",
    "title": "Four Stars",
    "rating": 4,
    "url": "http://www.amazon.com/product-reviews/B01M044EYV/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Jun 5, 2017 12:00:00 AM",
    "reviewContent": "OK",
    "classLabel": 4
  }
]