[
  {
    "review_id": "R16K1DFIO6E884",
    "title": "Came exactly as described***",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Sep 23, 2013, 12:00:00 AM",
    "reviewContent": "The seller was very honest and up front about the phone. It was exactly as described. The package did not have earbuds, but the charging cord($19.99) needed replacement. However, that little issue is not enough to downgrade the seller\u0027s rating. The phone is awesome, and it has been verified by the Apple Store to be genuine, and I already have it up and it is teaching me the way to use ios 7. That auto update occurred the morning after I activated service. I have three different sim chips and all three work just fine in the unlocked phone. I had to use a chip cutter to make the chips fit, but that was very easy to accomplish. GREAT SELLER!!!",
    "classLabel": 5
  },
  {
    "review_id": "R1PLVI83VQK5HZ",
    "title": "A really good purchase",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Dec 18, 2014, 12:00:00 AM",
    "reviewContent": "Excellent device! It works very well from the beginning. I am happy with it. It arrived a little be late but I was told it would happened because of a problem when I place my order. The phone was brand new and exactly as it was advertised. Just one thing, it came in a box that was originally for a 16GB model, but with a sticker that said it actually was a 32 GB model. I was worried about this but as soon as I turned it on I confirmed It was a 32GB model. It works fine in Venezuela with Movilnet as long as there is 3G network coverage.",
    "classLabel": 5
  },
  {
    "review_id": "ROORI1TA18F9P",
    "title": "I am disgusted with purchase",
    "rating": 2,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Sep 23, 2015, 12:00:00 AM",
    "reviewContent": "The Iphone has scratches, scuffs on the sides, a lot of dust and dirt. In addition, the charger, cable box and headphones are not the originals. I am disgusted with purchase!!!",
    "classLabel": 2
  },
  {
    "review_id": "R1SUVPOCD4WXF5",
    "title": "Was happy that I got it unlocked",
    "rating": 1,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Oct 25, 2016, 12:00:00 AM",
    "reviewContent": "Was happy that I got it unlocked, but after I used it. My smile quickly turned upside down, my battery went from 100 percent to 1 percent... have to alway have it charged is I wanted to use it. So most likely I\u0027m going to have to buy a new battery for it. Never again that I go online for a phone smh...",
    "classLabel": 1
  },
  {
    "review_id": "RH7WNB33Z6LW6",
    "title": "BEST APPLE IPHONE EVER!!!",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Feb 9, 2017, 12:00:00 AM",
    "reviewContent": "This has got to be apples best cellphone line ever invented ever. This product has saved my life, well as far as the storage on it goes for taking pictures and keeping videos.",
    "classLabel": 5
  },
  {
    "review_id": "R26Q8N9H2J3CTG",
    "title": "Happy but not Happy",
    "rating": 2,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Jun 30, 2017, 12:00:00 AM",
    "reviewContent": "Received phone in promised time it is in excellent condition outwardly took it to the Metro PC they installed a SIM card I have Service but this download is awful it\u0027s very Very slow I\u0027ve always had I phones but Thought I\u0027d try a Samsung android don\u0027t like it but couldn\u0027t afford a new I phone So I bought the 5 which I had one before so I know the one I had bought new when the 5 came out is much faster than this one I bought from you also in the middle of a download it will just stop a there is a blank scree. No I\u0027m not happy with my purchase",
    "classLabel": 2
  },
  {
    "review_id": "RMPXIE5M6ZX57",
    "title": "Fake Apple accessories",
    "rating": 4,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Mar 23, 2014, 12:00:00 AM",
    "reviewContent": "While the phone is as described and works well, the accessories are a lie. I compared both the EarPods and the lightning cable to some I bought directly from Apple and was sorely disappointed. The accessories I just purchased both look and feel cheap when set next to the real deal, though they might fool some people. What tipped me off initially was the fact that the L on the left headphone had started to rub off after just using them for a day. Even the USB icon on the charging cable is a slightly lighter color than that of the actual Apple cable.",
    "classLabel": 4
  },
  {
    "review_id": "R3U066IRN6TUX2",
    "title": "My life is much more organized now",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Sep 9, 2015, 12:00:00 AM",
    "reviewContent": "What can I say - it\u0027s an Iphone, and as a devoted fan of the Ipad (not a crazy follower of the Apple cult though), it\u0027s great to finally have a phone that syncs perfectly with my needs (had an Android before). I would never want to pay what one has to pay for an Iphone 6, and so far, the 5 works perfectly fine for me, it came in mint condition and no issues regarding the battery life.",
    "classLabel": 5
  },
  {
    "review_id": "RAOLTCUITYF4R",
    "title": "Exactly right",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "May 7, 2017, 12:00:00 AM",
    "reviewContent": "Very good description, very thankful the carriers were listed. Wonderful condition for the price and use it every time I go out-still learning because I bought after using my flip phone for years and years!",
    "classLabel": 5
  },
  {
    "review_id": "R26BR34SGXS87M",
    "title": "awesome! still working perfectly...",
    "rating": 5,
    "url": "http://www.amazon.com/product-reviews/B0097CZBH4/?sortBy\u003dhelpful\u0026pageNumber\u003d0",
    "date": "Apr 3, 2017, 12:00:00 AM",
    "reviewContent": "Your the best! after all these years it\u0027s still in perfect working condition, awesome! I would buy it from them again with-out any worries. Only thing I had to replace was the flex-cable where the lightning cable plugs in-to, it\u0027s from just wear and tear of time... But to prevent that from happening again, I bought a little magnetic adapter (Magnetic Charging Cable with 2 Connectors Lightning \u0026 Micro USB for iPhone5). It works wonders. No more worries.",
    "classLabel": 5
  }
]